Autodesk.Revit.DB.Events.GetHubsRequestedEventArgs.GetHubs
gets CloudHub values within Event.
Since:
2019

Autodesk.Revit.DB.Events.GetHubsRequestedEventArgs.SetHubs(System.Collections.Generic.IList{Autodesk.Revit.DB.ForgeDM.CloudHub})
Sets CloudHub values within Event.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Events.GetHubsRequestedEventArgs.#ctor
Since:
2019

Autodesk.Revit.DB.Events.GetHubsRequestedEventArgs
Event arguments used by the ForgeDM Hubs event.
Sets CloudHub values within Event.
Gets CloudHub values within Event.
Since:
2019